---
layout: post
title: Tips n Tricks #2
categories:
- tips_n_tricks
---
Как искать с помощью Google

1. Один из нескольких (логическое ИЛИ). По-умолчанию Google ищет страницы, которые содержат все слова из поискового запроса, но если требуется выдать и те, которые содержат хотя бы одно слово из заданного множества, можно воспользоваться логическим оператором ИЛИ. Ему соответствует символ "|" (по-английски он именуется pipe symbol). Пример: молоко|огурцы|селедка.

2. Кавычки. Если вам необходимо найти определенную фразу дословно, можно использовать кавычки. Пример: "Hotel California" (аналогичный запрос без кавычек вернул бы не только ссылки на все упоминания одноименной песни, но и на множество сайтов тур-операторов и гостиниц).

3. Исключение (логическое НЕ). Для того, чтобы исключить из результата поиска те страницы, которые содержат определенное слово, в поисковом запросе необходимо использовать символ "-". Пример: linux distrib download -suse (запрос вернет ссылки на страницы для скачивания различных дистрибутивов Linux, за исключением Suse).

4. Похожие слова. Для того, чтобы Google искал слова, похожие на заданное, используйте символ "~" (тильда). Будут найдены синонимы и слова с альтернативными окончаниями. Пример: ~hippo (по запросу будет так же найдено, например, слово hyppopotamus).

5. Маски. Символ "*" можно использовать как маску - условное обозначение произвольного количества любых символов. Это может быть полезно, например, если вы пытаетесь найти текст песни, но не можете при этом точно вспомнить слова. Или отыскать сайт, домен которого запомнился только отчасти. Пример: welcome to the hotel * such a lovely place; *pedia.org.

6. Расширенный поиск. Если вы забыли какой-либо из перечисленных операторов, всегда можно воспользоваться формой расширенного поиска.

7. Определения. Используйте оператор define: для быстрого поиска определений. Пример: define:Ктулху (запрос выдаст ссылку на страницу из Википедии).

8. Калькулятор. Одной из полезных и при этом малоизвестных возможностей Google является вычисление арифметических выражений. В выражениях можно использовать операторы +, -, *, /, ^ (степень), sqrt (квадратный корень), sin, cos, tan, ln, lg, exp (ex), скобки и много чего еще. Пример: sqrt(25 * 25) * 768.

9. Числовые интервалы. В Google существует еще одна малоизвестная возможность - поиск числовых интервалов, которые можно задавать с помощью крайних значений, разделенных последовательностью из двух точек. Пример: Букер 2004..2007.

10. Поиск на заданном сайте. С помощью оператора site: можно ограничить результаты поиска определенным веб-сайтом. Именно эта возможность обычно используется при установке поисковых форм Google на сторонних ресурсах. Пример: seagate barracuda site:ixbt.com.

11. Ссылки извне. С помощью оператора link:, можно найти страницы, которые ссылаются на заданный URL. Оператор можно использовать не только для главного адреса сайта, но и для отдельных страниц. Оператор не дает гарантии, что в результате поиска будут перечислены абсолютно все страницы. Пример: link:banana.by.

12. Вертикальный поиск. Вместо того, чтобы искать заданные слова во всем вебе, можно ограничить поиск какой-либо одной определенной сферой. В Google входит множество поисковых сервисов, позволяющих находить интересующую информацию в блогах, новостях, книгах, и многих других категориях:
        
        * Blog Search
        * Book Search
        * Scholar
        * Catalogs
        * Code Search
        * Directory
        * Finance
        * Images
        * Local/Maps
        * News
        * Patent Search
        * Product Search
        * Video
        * Linux resouces search and BSD resouces search

13. Кино. Для поиска названий фильмов удобно использовать оператор movie:. Пример: movie:One Flew Over the Cuckoo's Nest.

14. Музыка. Оператор music: ограничит результаты поиска контентом, который тем или иным образом связан с музыкой. Пример: music:Depeche Mode 101.

15. Преобразователь единиц измерения. Google можно использовать для быстрого преобразования метров в ярды, килограммов в фунты, литров в джоули. Для этого используется абсолютно естественный для человеческого понимания синтаксис. Пример: 16 tons in pounds.

16. Числовые шаблоны. Алгоритмы Google умеют распознавать тип числовых данных по шаблону их ввода. К сожалению, большинство этих шаблонов соответствуют только американским стандартам. В частности можно искать:
        
        * региональные телефонные коды;
        * номера автомобилей (US, как не сложно догадаться, only);
        * инвентарные номера Федеральной Комиссии Коммуникаций FCC (так же US only);
        * UPC (универсальные товарные коды, применяемые в США);
        * регистрационные номера Федерального авиационного агентства (США);
        * номера патентов (США);
        * биржевые котировки (нужно использовать символы акций) и прогноз погоды на пять дней вперед.

17. Типы файлов. В случае, если вы хотите искать, например, только документы в формате PDF, Word или Excel, можно использовать оператор filetype:. Список поддерживаемых форматов: Adobe Reader PDF (.pdf), Adobe Postscript (.ps), Autodesk DWF (.dwf), Google Earth (.kml, .kmz), Microsoft Excel (.xls), Microsoft PowerPoint (.ppt), Microsoft Word (.doc), Rich Text Format (.rtf), Shockwave Flash (.swf). Пример: stroustrup c++ language filetype:pdf. Для выбора типа искомых файлов так же можно использовать оператор ext:.

18. Местоположение слова. По-умолчанию Google ищет заданный текст внутри содержимого страниц. Но если есть необходимость искать в некоей определенной области, можно использовать такие операторы как "inurl:" (поиск внутри URL), "intitle:" (поиск в заголовке страницы), "intext:" (поиск в тексте страницы), и "inanchor:" (поиск в тексте ссылок).

19. Кэшированные страницы. При поиске устаревших страниц и страниц, контент которых был обновлен, может помочь поиск в кэше поисковой машины. Для этого предназначен оператор cached:. Существует так же близкий по смыслу оператор cache:, с помощью которого можно сразу получать страницы из кэша по их URL. Этой возможностью в принципе можно пользоваться как своеобразным бэкапом видимых для Google веб-страниц: даже если страница будет удалена со своего сайта, на Google может остаться ее копия.

20. Поиск лиц. У поисковика картинок есть интересная возможность - выделять из всего множества найденных изображений лица. Для того, чтобы этим воспользоваться, необходимо добавить к URL результата поискового запроса дополнительный GET-параметр imgtype=face. Пример: http://.../images?q=alsu&imgtype=face

21. Информация о сайте. С помощью оператора info: можно получить известную Google информацию об указанном сайте. Пример: info:p-i-f.livejournal.com.

22. Похожие сайты. С помощью оператора related: Google может выдать список сайтов, которые считает похожим на заданный. Пример: related:p-i-f.livejournal.com.

23. Способы представления. Помимо стандартного представления результатов поиска, существуют ещё два экспериментальных, которые можно активировать с помощью оператора view:. Первый из них - timeline предназначен для отображения различных хронологических событий и может наглядно представить распределение результатов поиска на временной оси. Пример: George Washington view:timeline (результатом подобного запроса будет некое подобие биографии, материалы которой собраны с множества ресурсов Сети).

Второй способ отображения - map удобен для поиска по картам. При его выборе, в отчёте с результатами поиска сразу открывается фрейм с картой, на которой указателями помечено то, что нашел Goolge. Пример: fifth avenue ny view:map. 

PS

А вот еще отличный способ искать музыку: -inurl:(htm|html|php) intitle:"index of" "last modified" "parent directory" description size (wma|mp3) "music". Вместо music пишите то, что нтересует (группу или песню).

PPS 

Честно упёрто у пользоватетя [Laroy](http://laroy-ru.livejournal.com/tag/%D0%98%D0%A2). Там вообще много интересного.
